applications/solvers/cokeCombustionFoam/SegregatedSteps/runs/porousMedia/enableFullFeatures/convectionLimited/0/coke
/*--------------------------------*- C++ -*----------------------------------*\
  =========                |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      coke;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
48000
(
0.0
0.0
0.0
0.0
0.0
0.0
0.0
0.0
...
)
;


boundaryField
{
    "(inlet|outlet|top|bottom)"
    {
        type            fixedValue;
        value           uniform 0; 
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
